<section class="about" id="about">
    <div class="portfolio__container">
        <div class="portfolio__body">
            <h2 class="portfolio__title title scroll-item">Обо мне</h2>
            {{-- <h4 class="portfolio__subtitle subtitle">Немножко обо мне, как о fullstack разработчике</h4> --}}
        </div>
        <div class="about__article">
            <p class="about__text scroll-item">
                Меня зовут Наталья у меня красный диплом (специальность информатик-аналиитик, РГУТиС). После университета я долго работала не по специальности в Минэкономразвития России. Я уволилась в 2020 году и изучала программирование самостоятельно.<br>Мой опыт разработки около трех лет. Работала fullstack программистом в магазине "Книжный Лабиринт". Добираться до них было ну очень долго и я оттуда ушла. Далее была удаленная стажировка на портале mos.ru, все закончилось двухмесячным ковидом у всей моей семьи. Спасаясь от повторения болезни, я оказалась на даче с детьми, ноутбуком и личным проектом интернет-магазина автозапчастей.<br>Сейчас сайт не развивается в связи с последними событиями в Украине. Но магазин продолжает функционировать для старых клиентов, кто уже о нас знает, а также для тех, кто сам случайно наткнулся в интернете (несведущему человеку найти мой сайт крайне проблематично). Я хочу сказать то, что сео-оптимизация под поисковые запросы оставлет желать лучшего в настоящий момент:)<br><br>Итак, находясь на даче, я продолжила самообучение. Написала фреймворк на php по урокам на youtube. Многое пришлось додумывать самостоятельно, готовый вариант мне понравился. Далее я занималась по курсу JavaScript, а затем углубилась в верстку, стили и все с этим связанное (sass, БЭМ, webpack и тд). Мне очень понравилось, хотя раньше я пренебрегала этими флексами и гридами. Зачем это все нужно, если можно взять готовые компоненты из Bootstrap или Tailwind? На деле стили и верстка оказались очень интересными вещами и совсем несложными, в отличие от backend. Постепенно родилась идея этого сайта-портфолио. Здесь собраны все работы по верстке, код есть на гитхаб
            </p>
            <a href="https://github.com/borashek32/digitalcoffeedesign.com.git" class="about__link scroll-item" target="_blank">
                репозиторий этого сайта
            </a>
            <p class="about__text scroll-item">
                Я очень люблю то, чем занимаюсь! Часто получается так, что мое самообучение идет в разрез с здоровым образом жизни. То есть для меня не составляет проблемы отнять полночи у сна в пользу гридов или какой-нибудь классной анимации.<br>Я нахожу интересные уроки на Youtube или красивые макеты в Figma (может быть, в Photoshop) и стараюсь в точности повторить понравившийся дизайн. Иногда я добавляю от себя в тех местах, где невозможно воспроизвести PixelPerfect верстку. Я могу написать бургер меню, слайдер и табы на JavaScript или JQuery. Знаете, я хоть и прослушала курс по этому языку, но применить свои знания на практике оказалось гораздо сложнее. Я нашла выход - делаю по урокам сначала на примере, потом прикручиваю на сайт.<br><br>Важное дополнение, вернее, основополагающее, я перфекционист во всем, не терплю неудач, ищу новое, бросаюсь и изучаю, до боли ответственна и переживаю за свою работу, как за детей. А еще я очень люблю делиться своими работами (поэтому этот сайт и существует), получать конструктивную обратную связь и исправлять ошибки. Так что, если посмотрели и дочитали до этого места, оставьте свое мнение в форме ниже:)
            </p>
        </div>
    </div>
</section>